{
    "type": "bundle",
    "id": "bundle--c388f977-af18-4e37-87ef-4dc7f2a0d993",
    "objects": [
        {
            "type": "attack-pattern",
            "spec_version": "2.1",
            "id": "attack-pattern--91907ea3-beed-40bd-b4d6-1875893568a6",
            "created_by_ref": "identity--b73c59c1-8560-449a-b8d0-c2ce0533c5bf",
            "created": "2020-02-05T20:28:15.203Z",
            "modified": "2020-08-07T18:23:25.731305Z",
            "name": "Virtual Machine Detection",
            "description": "Detects whether the malware instance is being executed in a virtual machine (VM), such as VMWare. If so, conditional execution selects a benign execution path.",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-mbc",
                    "phase_name": "anti-behavioral-analysis"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-mbc",
                    "url": "https://github.com/MBCProject/mbc-markdown/blob/master/anti-behavioral-analysis/detect-vm.md",
                    "external_id": "M0009"
                },
                {
                    "source_name": "external_source",
                    "url": "https://www.fireeye.com/blog/threat-research/2011/01/the-dead-giveaways-of-vm-aware-malware.html"
                },
                {
                    "source_name": "external_source",
                    "url": "http://unprotect.tdgt.org/index.php/Sandbox_Evasion"
                },
                {
                    "source_name": "external_source",
                    "url": "https://www.hackread.com/gravityrat-malware-evades-detection-targets-india/"
                },
                {
                    "source_name": "external_source",
                    "url": "https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/webcobra-malware-uses-victims-computers-to-mine-cryptocurrency/"
                },
                {
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/techniques/T1497/",
                    "external_id": "T1497"
                }
            ],
            "object_marking_refs": [
                "marking-definition--093b6375-cd45-4aa3-8f91-6a03ddd7a3d3"
            ],
            "x_mitre_methods": [
                {
                    "definition": "Virtual machines create files on the file system (e.g., VMware creates files in the installation directory C:\\Program Files\\VMware\\VMware Tools). Malware can check the different folders to find virtual machine artifacts (e.g., Virtualbox has the artifact VBoxMouse.sys). [[2]](#2)",
                    "name": "Check File and Directory Artifacts"
                },
                {
                    "definition": "VMware leaves many artifacts in memory. Some are critical processor structures, which, because they are either moved or changed on a virtual machine, leave recognizable footprints. Malware can search through physical memory for the strings VMware, commonly used to detect memory artifacts. [[2]](#2)",
                    "name": "Check Memory Artifacts"
                },
                {
                    "definition": "Virtual machines often include specific named system objects by default, such as Windows device drivers, which can be detected by testing for specific strings, whether found in the Windows registry or other places.",
                    "name": "Check Named System Objects"
                },
                {
                    "definition": "The VMware Tools use processes like VMwareServices.exe or VMwareTray.exe, to perform actions on the virtual environment. Malware can list the process and searches for the VMware string. Process related to Virtualbox can be detected by malware by query the process list. [[2]](#2)",
                    "name": "Check Processes"
                },
                {
                    "definition": "Virtual machines register artifacts in the registry, which can be detected by malware. For example, a search for \"VMware\" or \"VBOX\" in the registry might reveal keys that include information about a virtual hard drive, adapters, running services, or virtual mouse. [[2]](#2) Example registry key value artifacts include \"HARDWARE\\Description\\System (SystemBiosVersion) (VBOX)\" and \"SYSTEM\\ControlSet001\\Control\\SystemInformation (SystemManufacturer) (VMWARE)\"; example registry key artifacts include \"SOFTWARE\\VMware, Inc.\\VMware Tools (VMWARE)\" and \"SOFTWARE\\Oracle\\VirtualBox Guest Additions (VBOX)\". [[5]](#5)",
                    "name": "Check Registry Keys"
                },
                {
                    "definition": "VMwareService.exe runs the VMware Tools Service as a child of services.exe. It can be identified by listing services. [[2]](#2)",
                    "name": "Check Running Services"
                },
                {
                    "definition": "Malware may check whether software is relatively current.",
                    "name": "Check Software"
                },
                {
                    "definition": "The presence of virtual devices can indicate a virtualized environment (e.g., \"\\\\.\\VBoxTrayIPC\"). [[5]](#5)",
                    "name": "Check Virtual Devices"
                },
                {
                    "definition": "Malware may check windows for VM-related characteristics such as:\n\t* *Window size*: tiny window size may indicate a VM.\n\t* *Unique windows*: may check for the presence of known windows from analysis tools running in a VM.\n\t* *Title bars*: may inject malicious code to svchost.exe to check all open window title bar text to a list of strings indicating virtualized environment.",
                    "name": "Check Windows"
                },
                {
                    "definition": "Virtual machines offer guest additions that can be installed to add functionality such as clipboard sharing. Detecting the process responsible for these tasks, via its name or other methods, is a technique employed by malware for detecting whether it is being executed in a virtual machine.",
                    "name": "Guest Process Testing"
                },
                {
                    "definition": "In three browser families, it is possible to extract the frequency of the Windows performance counter frequency, using standard HTML and Javascript. This value can then be used to detect whether the code is being executed in a virtual machine, by detecting two specific frequencies commonly used in virtual but not physical machines.",
                    "name": "HTML5 Performance Object Check"
                },
                {
                    "definition": "Detects whether there is any \"user\" activity on the machine, such as the movement of the mouse cursor, non-default wallpaper, or recently opened Office files. If there is no human activity, the machine is suspected to be a virtualized machine and/or sandbox. Other items used to detect a user: mouse clicks (single/double), DialogBox, scrolling, color of background pixel, change in foreground window [[5]](#5).",
                    "name": "Human User Check"
                },
                {
                    "definition": "Different aspects of the hardware are inspected to determine whether the machine has modern characteristics. A machine with substandard specifications indicates a virtual environment: \n   * *Total physical memory*: most modern machines have at leave 4 GB of memory. (GlobalMemoryStatusEx) [[5]](#5).\n   * *Drive size*: most modern machines have at least 80 GB disks. May use DeviceloControl (IOCTL_DISK_GET_LENGTH_INFO) or GetDiskFreeSpaceEx (TotalNumberOfBytes) [[5]](#5).\n   * *USB drive*: checks whether there is a potential USB drive; if not a virtual environment is suspected.\n   * *Printer*: checks whether there is a potential connected printer or default Windows printers; if not a virtual environment is suspected.\n   * *Processor count*: checks number of processors; single CPU machines are suspect.\n   * *Keyboard layout*",
                    "name": "Modern Specs Check"
                },
                {
                    "definition": "Malware may check for hardware characteristics unique to being virtualized, allowing the malware to detect the virtual environment. Items checked include:\n   * *BIOS*: characteristics of the BIOS, such as version, can indicate virtualization.\n   * *I/O Communication Port*: VMware uses virtual I/O ports for communication between the virtual machine and the host operating system to support functionality like copy and paste between the two systems. The port can be queried and compared with a magic number VMXh to identify the use of VMware.\n   * *CPU Name*\n   * *CPU Location*: When an Operating System is virtualized, the CPU is relocated. [[2]](#2)\n   * *MAC Address*: VMware uses specific virtual MAC address that can be detected. The usual MAC address used started with the following numbers: \"00:0C:29\", \"00:1C:14\", \"00:50:56\", \"00:05:69\". Virtualbox uses specific virtual MAC address that can be detected by Malware. The usual MAC address used started with the following numbers: 08:00:27. [[2]](#2)",
                    "name": "Unique Hardware/Firmware Check"
                },
                {
                    "definition": "The execution of certain x86 instructions will result in different values when executed inside of a VM instead of on bare metal. Accordingly, these can be used to detect the execution of the malware in a VM. [[2]](#2)\n   * *SIDT (red pill)*: Red Pill is an anti-VM technique that executes the SIDT instruction to grab the value of the IDTR register. The virtual machine monitor must relocate the guest's IDTR to avoid conflict with the host's IDTR. Since the virtual machine monitor is not notified when the virtual machine runs the SIDT instruction, the IDTR for the virtual machine is returned.\n   * *SGDT/SLDT (no pill)*: The No Pill technique relies on the fact that the LDT structure is assigned to a processor not an Operating System. The LDT location on a host machine will be zero and on a virtual machine will be non-zero.\n   * *SMSW*\n   * *STR*\n   * *CPUID*: Checking the CPU ID found within the registry can provide information to system type.\n   * *IN*\n   * *RDTSC*\n   * *VMCPUID*\n   * *VPCEXT*",
                    "name": "Instruction Testing"
                }
            ]
        }
    ]
}